esp-cpp/espp/components/switch2_pro/example/sdkconfig.defaults
# Default target is esp32s3 (buildable/flashable today). NOTE: the Switch 2
# drives a 5 ms connection interval that only RISC-V targets (C6/C61) can accept
# via the opt-in NimBLE patch; on S3 the console may disconnect mid- or
# post-pairing (watch the connect interval + disconnect reason in the log). Use
# `idf.py set-target esp32c6` + CONFIG_SWITCH2_PRO_PATCH_NIMBLE_5MS=y for the
# full path. See DESIGN.md.
CONFIG_IDF_TARGET="esp32s3"

# On the ESP32-S3 (native USB), route the console to USB-Serial-JTAG so the
# monitor shows the pairing trace. Harmless on boards with a UART bridge too.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Common ESP-related
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# BT config: NimBLE only (the Switch 2 controller interface is BLE)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y
# Bring-up debugging: let the NimBLE host log GAP/ATT activity (MTU exchange,
# service discovery, connection-parameter updates, subscribes) so we can see
# what the console does at the stack level — our characteristic callbacks only
# fire on value reads/writes, not on discovery. Set back to _NONE when settled.
CONFIG_BT_NIMBLE_LOG_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_BT_NIMBLE_NVS_PERSIST=y
CONFIG_BT_NIMBLE_GAP_DEVICE_NAME_MAX_LEN=100
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192

# NOTE: MAX_CCCDS should be 4 * MAX_BONDS
CONFIG_BT_NIMBLE_MAX_BONDS=3
CONFIG_BT_NIMBLE_MAX_CCCDS=128

# The Switch 2 console drives a 5 ms connection interval (below the BLE spec
# minimum). Stable input streaming additionally requires the opt-in NimBLE
# patch — enable it (RISC-V targets only) and understand the caveats:
# CONFIG_SWITCH2_PRO_PATCH_NIMBLE_5MS=y
